mark_list = [
    (1, 'Samsung', 'Samsung', 70000, 2000_01_01, 'Лицензия' 'гарантийный талон' 'инструкция', 'Константин', 35_000),
    (2, 'Philips', 'Philips', 60000, 2000_02_01, 'Лицензия''гарантийный талон''инструкция', 'Кирилл', 30_000),
    (3, 'Sony', 'Sony', 50000, 2000_05_01, 'Лицензия'" "'гарантийный талон'" "'инструкция', 'Игорь', 25_000),
    (4, 'Pioneer', 'Pioneer', 40000, 2000_02_01, 'Лицензия''гарантийный талон''инструкция', 'Кирилл', 20_000),
    (5, 'Toshiba', 'Toshiba', 30000, 2000_01_01, 'Лицензия''гарантийный талон''инструкция', 'Игорь', 15_000),
    (6, 'LG', 'LG', 20000, 2000_05_01, 'Лицензия''гарантийный талон''инструкция', 'Игорь', 10_000),
    (7, 'Logitek', 'Logitek', 100000, 2000_03_01, 'Лицензия''гарантийный талон''инструкция', 'Кирилл', 50_000),
    (8, 'LGOG', 'LGOG', 120000, 2000_01_01, 'Лицензия''гарантийный талон''инструкция', 'Игорь ', 60_000),
    (9, 'CAT', 'CAT', 160000, 2000_09_01, 'Лицензия''гарантийный талон''инструкция', 'Константин', 80_000),
    (10, 'Hurma', 'Hurma', 130000, 2000_12_01, 'Лицензия''гарантийный талон''инструкция', 'Игорь', 65_000)
]